Reports/КвизРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>КвизРезультаты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/КвизРезультаты/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВарианта(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений")
	И Отчет.Вариант <> Элемент.Значение
	Тогда
		Отчет.Вариант		= Элемент.Значение;
		ВариантУстановить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВариант(Команда)
	ВариантыОтчета.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораВарианта", ЭтотОбъект), "Выберите вариант", ВариантыОтчета.НайтиПоЗначению(Отчет.Вариант));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыУстановить();
	
	ВариантыОтчета.Добавить("Топ10", "Топ 10");
	ВариантыОтчета.Добавить("Общий", "Общий");
КонецПроцедуры

&НаСервере
Процедура ПараметрыУстановить()
	Если Параметры.Свойство("Уровень") Тогда
		АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		ЗаполнитьЗначенияСвойств(Отчет, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВариантУстановить()
	Вариант = ВариантыОтчета.НайтиПоЗначению(Отчет.Вариант);
	Если Вариант = Неопределено Тогда
		Вариант				= ВариантыОтчета.Получить(0);
		Отчет.Вариант		= Вариант.Значение;
	КонецЕсли;
	Если НЕ (Отчет.Уровень = -1 И Отчет.КоличествоВопросов = 0) Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
	Заголовок = СтрШаблон("Квиз-результаты (%1)", Вариант.Представление);
КонецПроцедуры

&НаКлиенте
Процедура УровеньОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отчет.Уровень = -1;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ЗаполнитьЗначенияСвойств(Отчет, ВладелецФормы);
	КонецЕсли;
	СкомпоноватьРезультат();
КонецПроцедуры
